In [3]:
import pandas as pd
data=[["srujan",67],["noone",78],["thilak",25]]
data

[['srujan', 67], ['noone', 78], ['thilak', 25]]

In [6]:
pd.DataFrame(data,columns=["Name","Marks"])

     Name  Marks
0  srujan     67
1   noone     78
2  thilak     25

In [8]:
import numpy as np
arr=np.array([[1,2],[4,3]])
df=pd.DataFrame(arr,columns=["A","B"])
df

   A  B
0  1  2
1  4  3

In [10]:
data=pd.read_excel("data.xlsx")
print(data)

        Name School  Marks
0     Srujan    ssl     23
1      Biraj    sdd      5
2     Nithin    sdd    467
3     Thilak   bkl'    878
4    vinnuth     ds     98
5   Sakshtah   sdsd    654
6   Pratheek     ds    334
7      Sujan     ds     88
8     Harami     jh     98
9     Nandhi     ds     65
10   Sushant     ds     33

In [11]:
sample_data=pd.read_csv("https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv")
print(sample_data)

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [12]:
sample_data.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [13]:
sample_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [19]:
sample_data.describe()

(244, 7)

In [20]:
sample_data.shape

(244, 7)